import React from 'react'
import { Tag, Col, Row, Card, Icon } from 'antd'

const Detail = () =>(
    <div>
        <Row>
            <Col>
                <h1 className="text-align-center">Vim</h1>
            </Col>
        </Row>
        <Row className="margin-top-20">
            <Col>
                <div className="tool-description">
                    <p>
                        Vim是一个类似于Vi的文本编辑器，不过在Vi的基础上增加了很多新的特性，Vim普遍被推崇为类Vi编辑器中最好的一个，事实上真正的劲敌来自Emacs的不同变体。1999年Emacs被选为Linuxworld文本编辑分类的优胜者，Vim屈居第二。
                        但在2000年2月Vim赢得了Slashdot Beanie的最佳开放源代码文本编辑器大奖，又将Emacs推至二线，
                        总的来看， Vim和Emacs同样都是非常优秀的文本编辑器。
                        Vim(和Vi)一个最大的优势在于它最常用的命令都是简单的字符，这比起使用复杂的控制组合键要快得多，而且也解放了手指的大量工作，学习使用这些命令的时间很快。
                    </p>
                    <div className="margin-top-20">
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                        <Tag color="cyan">nihao</Tag>
                    </div>
                </div>
            </Col>
        </Row>
        <Row className="margin-top-20">
            <Col>
                <Card title="About This Tool">
                <div className="tool-about">
                    <h4>Vim 使用指南</h4>
                    <p>
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                    </p>
                </div>
                <div className="tool-about margin-top-20">
                    <h4>Vim 使用指南</h4>
                    <p>
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                    </p>
                </div>
                <div className="tool-about margin-top-20">
                    <h4>Vim 使用指南</h4>
                    <p>
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                    </p>
                </div>
                <div className="tool-about margin-top-20">
                    <h4>Vim 使用指南</h4>
                    <p>
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                    </p>
                </div>
                <div className="tool-about margin-top-20">
                    <h4>Vim 使用指南</h4>
                    <p>
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                        代理费看见爱上邓丽君法律的纠纷拉大锯法拉第计数法垃圾堆上发了卡机
                    </p>
                </div>
                </Card>
            </Col>
        </Row>
    </div>
);
export default Detail;
